Revit.Elements.ModelTextType
A Revit ModelTextType

Revit.Elements.ModelTextType.#ctor(Autodesk.Revit.DB.ModelTextType)
Construct from an existing Revit Element
type:

Revit.Elements.ModelTextType.InitModelTextType(Autodesk.Revit.DB.ModelTextType)
Initialize a ModelTextType element
type:

Revit.Elements.ModelTextType.InternalSetModelTextType(Autodesk.Revit.DB.ModelTextType)
Set the internal Element, ElementId, and UniqueId
modelTextType:

Revit.Elements.ModelTextType.ByName(System.String)
Select a ModelTextType from the current document by name
name:
Returns:

Revit.Elements.ModelTextType.FromExisting(Autodesk.Revit.DB.ModelTextType,System.Boolean)
Create from an existing Revit element
modelTextType:
isRevitOwned:
Returns:

Revit.Elements.ModelTextType.InternalModelTextType
Internal reference to the Revit Element

Revit.Elements.ModelTextType.InternalElement
Reference to the Element